application/basic/modules/bank/models/BankTransactionForm.php

SELECT * FROM `users` WHERE `id`='2'
SELECT * FROM `users` WHERE `id`='1'
---
    protected function validateTransaction()
    {
        $this->donator = Users::findOne($this->user_id_donator);
        if (!$this->donator)
            $this->addError('user_id_donator', '"' . $this->getAttributeLabel('user_id_donator') . '" не найден.');
        $this->acceptor = Users::findOne($this->user_id_acceptor);