application/basic/modules/bank/controllers/DefaultController.php

    public function actionSearchUser($term)
    {
        $results = [];
        $query = Users::find();

        if (is_numeric($term)) {
            $query->orFilterWhere([
                'id' => $term,
            ]);
        }

        if (is_string($term)) {
            $query->orFilterWhere(['like', 'name', $term]);
            //$query->orFilterWhere(['like', 'email', $term]);
        }

        foreach($query->asArray()->limit(10)->all() as $model) {
---
SELECT * FROM `users` WHERE (`id`='2') OR (`name` LIKE '%2%') LIMIT 10